export const data = <any>[
  {
    id: 10000,
    poster: {
      name: "智能科技学院学术部",
      avatar: "https://img2.baidu.com/it/u=966575083,3990920768&fm=253&app=120&size=w931&n=0&f=JPEG&fmt=auto?sec=1668963600&t=29f4f5474e0dc5ff664ef9f3c728c6fe"
    },
    name: "第十届程序设计大赛",
    startDate: "2022-11-15",
    endDate: "2022-11-30",
    startTime: "00:00",
    place: "绵阳校区3407教室",
    way: "线下",
    endTime: "24:00",
    opposition: 0,
    approves: 233,
    type: 0,
    predict: true,
    timenode: [
      {
        complete: 1, // true
        desc: "大赛启动仪式",
        date: "2022-11-18 18:48:26"
      },
      {
        complete: 0, // false
        desc: "大赛报名阶段和作品收集阶段",
        date: "2022-11-30 18:48:26"
      }
    ],
    content:
      "此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。",
    brief: "此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。"
  },
  {
    id: 10001,
    poster: {
      name: "Oracle 俱乐部",
      avatar: "https://img2.baidu.com/it/u=2269622343,3274358192&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500"
    },
    name: "第十三届企业信息化成果展示大赛",
    place: "绵阳校区3407教室",
    way: "线下",
    startDate: "2022-11-10",
    endDate: "2022-12-1",
    startTime: "00:00",
    endTime: "24:00",
    opposition: 1,
    approves: 333,
    predict: false,
    type: 2,
    timenode: [
      {
        complete: 1, // false
        desc: "大赛启动仪式",
        date: "2022-11-18 18:48:26"
      },
      {
        complete: 0, // false
        desc: "大赛报名阶段和作品收集阶段",
        date: "2022-11-24 18:48:26"
      }
    ],
    content:
      "此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。",

    brief:
      "当今时代发展的大方向是趋于信息化时代。与此同时，信息化的理念也在各行各业的企业管理过程中占据着重要地位。现由西南财经大学天府学院智能科技学院主办，西南财经大学天府学院甲骨文俱乐部承办的企业信息化成果展示大赛即将在我院拉开帷幕。"
  },
  {
    id: 10002,
    poster: {
      name: "智能科技学院勤工俭学",
      avatar: "https://img2.baidu.com/it/u=2269622343,3274358192&fm=253&fmt=auto&app=138&f=JPEG?w=500&h=500"
    },
    place: "绵阳校区3407教室",
    way: "线下",
    startDate: "2022-11-18",
    endDate: "2022-11-27",
    startTime: "00:00",
    endTime: "24:00",
    opposition: 1,
    approves: 333,
    type: 2,
    timenode: [
      {
        complete: 1, // true
        desc: "大赛启动仪式",
        date: "2022-11-18 18:48:26"
      },
      {
        complete: 1, // true
        desc: "大赛报名阶段",
        date: "2022-11-24 18:48:26"
      },
      {
        complete: 0, // false
        desc: "作品收集阶段",
        date: ""
      }
    ],
    predict: false,
    name: `“智芯”电子焊接大赛`,
    content:
      "此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。此次程序设计大赛旨在进一步加强学校教学质量工程建设，提高学生们的创造力以及运用计算机技术开发程序的综合能力，培养学生们的创新思维与合作精神，激发广大学生的学习热情。",
    brief:
      "踏入校园，恰逢天府20载！走进天府，迎接校园生日。在我校20周年到来之际，为全面提高大学生的综合素质，加强师生之间的交流，丰富大学校园的文化生活，引领校园文化的主流，促进同学们的学习、交流并激发他们学习的兴趣，同时也为了凸显本学院的特色，增强同学们对焊接相关技术领域的学习，提高专业技能。因此，在校庆到来之际特举办“智芯”电子焊接大赛体现智科学子的风采。"
  }
];
